app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "machine gun funk"], ["created_at", "2021-01-06 06:00:04.565020"], ["updated_at", "2021-01-06 06:00:04.565020"], ["artist_id", 5]]
---
  def create
    @song = Song.new(song_params)

    if @song.save